/* Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
14212 -> нет
12821 -> да
23432 -> да
*/

Console.Clear();
Console.WriteLine("Hi, User!")
Console.WriteLine("Enter a five-digit number ");
int number = Convert.ToInt32(Console.ReadLine());

int Palindrome (int )
{ 
    if ()
}


