/* Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
14212 -> нет
12821 -> да
23432 -> да
*/

Console.Clear();
Console.WriteLine("Hi, User!");
Console.WriteLine("Enter a five-digit number: ");
int fiveDigitNumber = Convert.ToInt32(Console.ReadLine());
int a = 0;
int b = 0;
int c = 0;
int d = 0;
int e = 0;

int Palindrome (int number)
{ 
    for (number >= 1000, number < 100000);
    { 
        int a = number/1000;
        int b = number/
    }
    return Math.Round(number/1000, MidpointRounding.ToZero);
]

int x = Palindrome (number);


